[
"A smart girl will make other men jealous and increase her man’s status. \n\n A dumb girl will make her own man jealous and increase his stress levels.",
"Men with the biggest hearts attract the most draining, disloyal, disrespectful & difficult women.",
"If you’re a man and you pay for a lady’s tuition fees thinking your sacrifices will make her loyal, sorry… \n\n Women don’t care about sacrifices, they care about what they feel at the moment. \n\n Stop playing a father’s role for a woman that isn’t your wife.",
"She’s loyal to you based off how much she respects you, not how much she likes you. \n\n Become respected by having high standards & being ready to leave her when she disrespects you.",
"Don’t beg for love. \n\n Don’t beg for respect. \n\n If she can’t give you those things herself, respect yourself enough to leave. \n\n Begging for it makes you look like a clown.",
"Don’t let your emotions trick you into thinking that she is magically one of a kind & special. \n\n She’s not most of the times.",
"You give 1 female your all and she’ll show you exactly why you need 10.",
"If her conversation is getting shorter with you, it’s getting longer with someone else.",
"The reason she’s ignoring you is because you’re always available for her",
"It TURNS HER ON to intuitively sense that you could f*ck other girls if you wanted to.",
"Get out ya feelings.. ain’t no money in there.",
"Remember, another guy is in her phone talking bad about you and she’s replying “stopp be niceeee” \n\n Focus on yourself bro.",
"Ex - “I miss you” \n\n Nahh you miss the attention i was giving you",
"If you have to ask her for permission to do what you want, you’re the girlfriend.",
"If she wants to come back in your life after she left you, it’s over.. that means she stopped existing for you. Never take her back, the streets can have her now.",
"Don’t date a girl you want, date a girl that wants you, she will treat you better.",
"You’re talking to a pretty girl. \n\n She says: \n\n “You won’t be taking me home tonight.” \n\n What do you say?",
"Wearing tight clothes and then blaming men for having eyes ? \n\n If you are that conscious about that, then make sure you wrap your bedsheet around you when you go out. \n\n More clothes = Fewer stares. Simple.",
"If she says, I am not ready for a relationship \" that means \" I am not done with the streets yet \"\"",
"Women already have a pussy they don’t want to have to deal with another one.",
"She wants to feel the thrill of losing control, \n\n And she feels that only when she is dominated and not simped for.",
"She can unfollow but she can't unswallow",
"We live in a world where every guy wanna make her day , you gotta stand out and ruin it. \n\n She will remember you for too long.",
"Her new man wasn't new man you just never knew man.",
"It's important to be manipulative - \n\n too much of them liking that shi nowadays.",
"Cinderella took off one shoe and found love , \n\n Your ex took off everything and still couldn't find a man better than you.",
"Sleeping around is degenerate \"",
"Girls play all the nice guys and then fall in love with someone toxically attractive. \n\n Becoming that man is important too , maybe you can take revenge for the bro she left.",
"Toxic Relationship ends , \n\n Life feels good again after sometime , \n\n Money keeps stacking , \n\n Then you realise it was never about women , you just needed you more than anything in this world.",
"Imagine posting to make me mad and I don't even view it lol",
"You can take her out of the streets \" but you can not take the streets out of her.\"",
"When you clap on the first night thinking you a goat but she let every mf do that. \n\n Sleeping around ain't that big of a flex these days , \n\n Having shi load of options and ignoring them is. \n\n Work on yourself , shawties are everywhere.",
"Her : You do you \n\n Me : On it \n\n Her : 46 missed calls , 90 texts , 7 threatzz \n\n Be this.",
"Sometimes you gotta say lol \" and move on to her long a$$ paragraphs.",
"Don’t reveal too much about yourself to anyone",
"Young Men, \n\n That girl for whom you are sacrificing your goals, \n\n Fighting with your parents, \n\n Ignoring your brothers, \n\n That exact girl will leave you when things go wrong.",
"Powerful people judge everything by what it costs, not just in money but in time, dignity, and peace of mind.",
"Too much presence creates the opposite effect: \n\n The more you are seen and heard from, the more your value degrades. \n\n You become a habit. \n\n No matter how hard you try to be different, subtly, without your knowing why, people respect you less and less.",
"Just because she’s crying, \n\n It doesn’t mean she’s telling the truth. \n\n Tears are her tool to manipulate you. \n\n Exceptions to this case do exist.",
"Fathers take care of their daughters. \n\n Brothers take care of their sisters. \n\n Husbands take care of their wives. \n\n Sons take care of their mothers. \n\n And we still have women on podcast saying we need men for what \"\"",
"As long as she acts irrational & like a little kid, \n\n She loves you. \n\n Once she starts acting rational & like a grown up, \n\n She lost feelings for you.",
"It's petty & insecure when a man cares about a woman's past. \n\n But it's praiseworthy & smart when a woman cares about a man's bank balance because she wants to secure her future.\n\n YEAH AIGHT.",
"A man who cares about his girl will be strict. \n\n He won’t let her do anything she wants.",
"Always being accessible to her will make her believe you have nothing going on in your life. \n\n And guess what? \n\n That will be the reason she leaves you. \n\n No woman wants to be the centre of a man’s life. \n\n She wants to be the addition, like the jewelery.",
"No one cares about your problems and stress as a man. \n\n Take full responsibility for the outcomes of your actions and refine them. \n\n Complaints hold no value, improvements do. \n\n No one is going to save you from a tragic existing but youself, take control.",
"Disrespect no matter how it was expressed should never be tolerated. \n\n Let people step on your toes and they’ll treat you like a doormat. \n\n Prioritize your self respect above all else. \n\n When your dignity is challenged never hesitate to be ruthless.",
"79% of millionaires are self-made.\n\n They didn’t inherit a single dollar from their parents.\n\n Becoming wealthy is never luck.",
"Indeed",
"Aight fair point",
"The most masculine thing you can do is become physically strong. \n\n Nothing comes close to the confidence you feel when you know you can inflict physical damage on anybody in the room.",
"If she isn’t replying to your texts within seconds of you texting. \n\n Good luck bro.",
"Join My Telegram For Daily Sales Knowledge",
"If she's not a detective, it means she's not in love. \n\n If your female doesn’t INVESTIGATE the potential women you MIGHT be talking to.\n\n If she doesn’t suspect you’re with another female when you don’t answer your phone.\n\n She doesn't truly love you.",
"Women like to get controlled. \n\n However they hate the idea of it upfront. \n\n But they would love it if executed by a man they are attracted to.",
"She is delusional",
"Don't wait too long to ask her out for a date. \n\n You must lead and progress things FAST. \n\n Women make up their minds quickly. \n\n She already knows her answer and you're just delaying the inevitable. \n\n You'll filter out the time wasters much more quickly that way.",
"When women say single AF, the “AF” means “and fucking”",
"When a woman is done with her 304 phase, she wants a “Nice Guy” to settle with who ignores her past. \n\n Don’t be that guy bro.",
"Get you a girl who can afford to not use makeup and still look good",
"“YOu MaDe Me thiS Way” \n\n How i make u suck 18 dicks.",
"Never ignore her PAST, cause it can ruin your FUTURE",
"SHE SAW YOUR TEXT BRO, DON’T DOUBLE TEXT HER!",
"I need a man with 7 figures of income \"",
"How to connect with her on a deeper level: \n\n 1. Sleep naked together \n\n Skin-to-skin contact releases oxytocin, the “love hormone” which provides the feeling of trust, relaxation & emotional connection. \n\n It can help you with stress, anxiety etc. \n\n Love is the cure.",
"Your ex is someone else's headache now. \n\n Peace.",
"If your metric of success revolves around how many women you can pull.\n\n You are doomed.",
"A boy becomes a man the day he walks away from a woman who disrespects him, \n\n Even though he loves her more than anything.",
"Most women don’t have high standards. \n\n Just high egos.",
"Choose love over respect & you will get neither.",
"Your future daughter will become exactly like her mother which YOU choose. \n\n If this scares you, \n\n You’re with the wrong woman.",
"Once you finally get to sleep with a girl, \n\n After you’ve been dating her for a while… \n\n And she wasn’t even that good at it? \n\n That’s a sign she has never done it before. \n\n Instead of complaining, be grateful you’re dating an inexperienced girl.",
"Once she stops being annoying, \n\n That’s when she stops loving you.",
"A woman shows her true loyalty after you two break up. \n\n If she remains single for a long time, \n\n It’s because she truly loved you. \n\n But if it doesn’t take her long to replace you? She probably cheated on you when you were together.",
"The most masculine thing a man can do is raise a family and properly teach his kids how to think, how to lead, how to make money, and how to build a great family of his own.",
"All men suffer. \n\n Great men choose to do it on their terms and to their benefit.",
"IQ is inversely correlated with the desire to be famous",
"After the breakup, \n\n Her revenge will be dating another guy. \n\n Your revenge will be becoming hotter, happier & more successful. \n\n Guess who will regret the breakup more.",
"A woman of high value will be bad at s*x. \n\n Because she kept herself for the right man & has never done it before. \n\n So, before you complain how your girl needs to learn some things… \n\n You should be grateful that YOU are the one who needs to teach her.",
"Harsh truth: \n\n If you don’t care about a woman’s past, \n\n You will only get the leftovers other men didn’t want.",
"If another man is able to steal your girl, \n\n It’s not that he’s actually better than you. \n\n It’s that your girl actually never truly loved you.",
"How to know if she’s the one: \n\n 1. She’s excited like a kid when she sees you.",
"If she can ignore you for a few hours, \n\n Then she doesn’t care about you. \n\n Next her.",
"Men ONLY: \n\n Is there any acceptable limit of tattoos on a woman's body?",
"If she discusses her guy problems with you, \n\n Just focus on yourself bro.",
"Contraceptive effectiveness: \n\n Condoms: 98% \n\n The pill: 99% \n\n Commenting “wow😍 on her posts: 100%\"",
"The single greatest life improvement you can make is the complete elimination of society’s voice from your head.",
"Guys, make a quick mental list of all of your male friends. \n\n Now make a list of the ones you’d trust alone in room with girlfriend, wife or daughter. \n\n Finally, ask yourself why you’re friends with anyone in the first group who isn’t also in the second group.",
"To desire growth is to desire pain.\n\n To desire fulfillment is to desire work.\n\n To desire strength is to desire suffering.\n\n To desire freedom is to desire discipline.\n\n The desire for any result inherently includes the desire for the actions or conditions required to produce it.",
"Masculinity isn’t what you eat or drink, the length of your beard, how heavy you lift or how often you smoke cigars.\n\n It’s living life on your own terms, how you respond to pressure, who looks to you during crises, the quality of your character and the reliability of your word.",
"If you ever caught your friend flirting with your girl, \n\n who would you blame?",
"Sometimes when all seems lost, it all comes down to prayer and faith.",
"Who got it hard in life ? \n\n Men or women ? \n\n Seriously ? This is the famous question of the modern world ? \n\n Aren't we supposed to make it easier for both of us?",
"Male depression would end if men START BUILDING. \n\n Female depression would end if women STOP CONSUMING.",
"Don’t blame women who don’t keep their word. \n\n Don't expect her to keep it. \n\n But set the correct consequences. \n\n Do what you said you will do = more attention from me. \n\n Don’t do what you said = no attention from me.",
"What you say: \n\n “I’m ready to give you a second chance.” \n\n What she hears: \n\n “I have no options, please accept me back!”",
"Every woman goes through a hoe phase because sex and the city told her its the best way to move on from someone.\n\n Right netflix ?",
"How do I take revenge with my ex?\"",
"Mindset Tip Fellas : \n\n If you don’t get the girl, its not going to affect how you feel, or change who you are. \n\n Your Life remains the same. \n\n FVCKING AMAZING. \n\n She didn't make you, so she can't break you.",
"Almost all women are attention seekers. \n\n If she isn’t trying her hardest to get your attention? \n\n She’s getting it from somewhere else.",
"If a woman leaves you, NEVER accept her back into your life. \n\n Not even if you still love her. \n\n Why? People need to realize that there are consequences for leaving you. \n\n Friends, Family, Business Partners, Other Women- they will all think TWICE before doing the same.",
"Not getting a reply from her is also a message.",
"Only trust men with a strong handshake.",
"No matter how tall or short,\n\n It's your duty to get jacked.",
"Unpopular opinion : I think most people drink alcohol because they want to fit in. \n\n Not because they like drinking alcohol.",
"How to know if she’s the one? \n\n 1. She supports you in things she benefits NOTHING from.",
"Women who have the least to offer will always be the ones who expect a lot from men.",
"Women with high body counts are empty, with no soul inside of them. \n\n Before you marry one, \n\n Think about your future kids. \n\n They will pay for the mistake you’ve made.",
"Missed a workout? \n\n Hit the next one. \n\n Had a bad meal? Make the next one healthy. \n\n Make it a rule to never miss twice.",
"Your competition isn’t other people. \n\n It’s instant gratification. \n\n It’s shitty food. It’s laziness. \n\n It’s self doubt. \n\n It’s procrastination. \n\n Your competition is the shit that makes you weak.",
"If she says she wants to take a break,\n\n Good luck dawg.",
"In today's world women don’t actually have high standards. \n\n They just have high egos.",
"Your ex is someone else's problem now.",
"If she's beautiful and also got a low follower count, she's a keeper.",
"Men stay in dying relationships hoping something will change .\n\n It won't. Respect yourself and move away.",
"Chicks don't want female nature explained to them.\n\n So calm down with the explanation of them on dates, lol.",
"A woman's Instagram is the best indicator of her red flags and green flags.",
"Modern Relationships: \n\n They meet. They talk. They catch feelings. \n\n They spend a good time together for a while.\n\n Then ghost each other for someone who would do the same.",
"Fat women deserve love too.\n\n But they gotta pay.",
"You are a man. Nobody is going to support you emotionally. \n\n An overly emotional man is a weak man. \n\n They will play with your emotions. They will laugh at you. They will manipulate you. Wake up.",
"“I go to clubs because I want to have fun!!” \n\n You want to have fun?\n\n Then turn on some music at home. You can dance however you want in your living room.\n\n Women don’t go to clubs for fun. It’s for attention. As plain and simple as that.",
"Likes attract likes. \n\n If she is the degenerative type , she will end up attracting the same kind.\n\n Make sure you are choosing a woman who saved herself for you.",
"More Attention = More $$$\n\n You can have the most astronomical product of the entire planet. \n\n However, if no one is seeing that, it is essentially useless.\n\n Make sure that others are aware that you exist. After then, a greater emphasis is placed on marketing to generate higher $$",
"It's mind-boggling to me that there are so many dating coaches\" on Twitter.",
"On Saturday evenings and all day Sunday, I do not sleep.\n\n 1.5 whole days of nothing but grinding. \n\n Develop the routine of working hard throughout the week and even harder on the weekends. \n\n This is how you outcompete your strongest rival in the market.",
"The LGBTQ agenda ( Explained )\n\n - They legalize gender transitions\n\n - Demand in gender formation increases\n\n - People pay a lot of $$ for surgeries, medications and fuck what\n\n - Government and pharmaceutical companies make a shit ton of money\n\n - Circle repeats",
"“ I preserver my energy ” \n\n No you don’t. \n\n You are using it as a cope of your less extroverted capabilities.",
"Create or consume.\n\n The one who consumes will lose inevitably as compared to the one who creates.",
"When a man says things like “Gender is a Social Construct”, realize that he is either cucked...or a retard.",
"Too much of conversing is only a good sign if done by a woman.",
"If you are looking for a 'Zero Risk' option, you are looking for the impossible. \n\n Every good option has some risk attached to it.",
"Mystery opens the gates of attraction. \n\n You close the door by revealing too much. \n\n People appreciate things that are scarce.",
"She is ignoring your dms because you failed your ancestors. \n\n Its all interlinked.",
"Heartbreak , Pain , Trauma will teach you more than 1000’s of motivational seminars. \n\n To get sculpted you must bear the flames of fire.",
"You can conquer the world WITH or WITHOUT a woman. \n\n Don’t get it wrong. \n\n Your dependency on her proves you are a softy. Her dependency on you proves you are a Tyrone.",
"She is always available for her best option.",
"It will also save your extra $200 that you would have gave to that retarded councillor.",
"Covid 19 booster Vaccine \"",
"In the teenage years, social hierarchies tend to favor individuals who are either genetically ascended or wealthy. \n\n If you are not attractive or wealthy, you can't expect other people to respect or admire you.",
"She will make the rules for the cuck. \n\n She will break those exact same rules for the Tyrone. \n\n A woman’s behaviour around you is a reflection of who you are as a man.",
"She is not hiding the phone , she is hiding the reason of why you should not be with her.",
"You can find hot women everywhere.\n\n But you can’t find valuable men everywhere.\n\n This connotation proves the theory.",
"If you are high value , she would love to declare it in the world. \n\n “ Look , my man is so hot ” \n\n If she isn’t posting you on her social media , you have a lot of problems my friend.",
"Switch the topic before she switches the man.",
"Since the dawn of human time , bravery has been appreciated. \n\n You can be the most intellectual man but if you lack balls you would still be a cuck.",
"You can have the most refined set of INTELLECTUAL ideologies. \n\n But if you don’t have enough EVIDENCE to back that up. \n\n You will still be considered average. \n\n Always remember we live in a result oriented world.",
"Tattoo on her boobs , she has been sucking a lot of dudes.",
"And still all of the 3 industries are massively profitable.\n\n People are too blind consuming negative that now it appears neutral to them.",
"You better damn well get paid&nbsp;or else you'll be the reason why&nbsp;someone else is getting paid. \n\n &nbsp;The elites belong&nbsp;to the first category.\n\n The masses, obviously, belong to the second category. \n\n Can't you see the damn correlation?\n\n SELL OR GET SOLD.",
"I have been through a lot Mike \"",
"You would know a lot of things about yourself once you reflect on your own woman. \n\n Her behaviour towards you , her tonality , the way she treats you will tell you more than any dating seminars.",
"If she ain’t shy , she will be the reason why you will cry.",
"She failed to replace you. \n\n Or \n\n She realised you were the best option she had.\n\n However make sure she got 0 chances of coming back in your LIFE.",
"The world is divided into two groups.\n\n On one side, majority of people , who consume more than they create.\n\n On the other, the wealthy of the world, who create more than they consume.\n\n It's a simple law.",
"Narcissists are arrogant on the outside, and insecure on the inside. \n\n Confident people are calm on the outside, and clam on inside.",
"Women have an instinct to protect children.\n\n Men have an instinct to protect women and children.\n\n Nobody has an instinct to protect men.",
"If a belief system is popular among the masses, it is almost certainly false.\n\n The masses are always wrong.\n\n The popular decision, and the correct decisions, are rarely the same.",
"CASH",
"Revenge is nothing more than a sentimental waste of time....and energy....and resources....and it involves unnecessary risk. \n\n Revenge Is For Fools.",
"Speed matters.\n\n If you and your competitors are equally good at every task, but they are 1% faster than you, you will lose every single time.\n\n A large part of the reason a high IQ is an advantage in life is this: almost everything in life is a race.",
"Nobody has ever gone from the bottom of a hierarchy to the top by following the rules.\n\n Why?\n\n Because rules are made by the powerful, for the powerful.\n\n In most hierarchies, the rules aren’t designed to facilitate upward mobility. They are designed to prevent upward mobility.",
"The Only People You Can Trust\n\n After Becoming Powerful,\n\n Are Those Who Were Loyal To You\n\n Before You Became Powerful.\n\n Everyone Else Is Loyal To Your Power, Not You.",
"A man is more likely to make it to the pinnacle of any macro dominance hierarchy than a woman, for many reasons.\n\n Male IQ is more variable than female IQ; most geniuses are men, and genius level intelligence is an immense advantage for transcending dominance hierarchies.",
"People who rank High On Agreeablenss, tend to be Naive. \n\n They Think Everyone Has Good Intentions\"",
"99% of what you learn inside a university is useless information with no real world application. \n\n The reason you get a university degree, is because employers demand it; employers demand it because they use it as a proxy measure for IQ.",
"All high-value man has been alone at some point.\n\n Just a few months spent grinding and becoming a better man.\n\n It'll change you.",
"There are plenty of beautiful women.\n\n There are few men who are mission-driven.\n\n She isn't the prize.\n\n You are.",
"Women want a winner.\n\n But once she gets him, \n\n she tames him till he becomes a loser, \n\n then proceeds to leave him for a better man, \n\n and this cycle repeats into infinity.\n\n Until she meets a winner who's also strong enough to tell her No.\"\"",
"Just KNOW that a very small percentage of males are capable of pulling this off. \n\n AND there's nothing wrong with only having one WIFE who adores you wholeheartedly. \n\n Who is feminine, looks after you, isn't a feminist, and loves you. \n\n Having someone like her is the real FLEX.",
"The entire purpose of this THREAD is to wake you up to reality. \n\n An average JOE can't even have a girlfriend and he's talking about having many WIVES.\n\n Pure delusion, like a bloated whale on podcast claiming to be a 10. \n\n Far away from TRUTH.",
"Sure, some men will be able to pull this off without POWER AND STATUS. \n\n However, very few MEN are capable of pulling this off. \n\n It's simple to sit on your COUCH and declare, Oh",
"Yes, you guessed correctly. \n\n NO is the answer. CHANCES are those guys probably just had 1 wife. \n\n Now what does all of this mean? \n\n It means to have multiple wives comfortable with each other. \n\n You must evolve into a guy of POWER AND STATUS.",
"Do you think GENGHIS's khan cook also had multiple wives?\"",
"Andrew Tate frequently says: \n\n Since the dawn of time",
"But bro , ANDREW TATE said : \n\n I can be in a relationship and still have SEX with other women.\"",
"4/ Of course, there are always exceptions to the rule, and not everyone is solely motivated by material gain or status. ⁣⁣\n\n ⁣⁣\n\n But if you're hoping to attract high-value individuals, it's important to bring something to the table yourself.⁣⁣\n\n ⁣",
"3/ Similarly, the probability that a woman will want to be romantically involved with you is higher if you have high status. ⁣⁣\n\n ⁣⁣\n\n This could mean having a high-paying job, being well-connected, or simply being perceived as successful in some way.⁣",
"1/ Relationships are often transactional, whether we like to admit it or not. ⁣⁣\n\n ⁣⁣\n\n People tend to be attracted to those who can provide them with some kind of benefit, whether that's financial, social, or emotional.⁣⁣⁣⁣",
"Few people are willing to admit these 5 harsh facts : \n\n ⁣",
"Women don’t like money.\n\n THEY LIKE FUN. \n\n And FUN costs money. \n\n The more she gets THOSE tingling feeling with you , the more ATTENTION she would like to have of yours.",
"How many places do you have where you can invite and f*ck any girl you want ? \n\n How many parts of your city have you been to?",
"How many places do you have to sleep when you're on the run? - hotels don't count\n\n How many men can you muster up when shit hits the fan and you need dudes on ground?",
"You come across as a beggar and your image is damaged.\n\n To be truly detached, you must be convinced of your value so that you can impose yourself on the people you meet.\n\n Remember that a woman is seduced first by the strength of your personality.",
"Stop worrying about what people think of you and your actions. \n\n Ignore sarcasm and be wary of compliments. \n\n If you ask too many questions, you give the impression that other people's opinions are more important than yours.",
"Think of yourself first and you will be valued for it.\n\n If you put people before yourself, they will see you as a disposable tool deserving of contempt and will use you.",
"Make yourself your priority.\n\n Love begins with yourself. \n\n If you don't love yourself, no one will love you.",
"If you feel the need to show off and expose yourself, you might have to fix some deep insecurities you have.\n\n Having high self-esteem and healthy ego don't mean that you constantly brag and play power games with everyone.",
"A weak ego is one that is not internally validated.\n\n A strong ego is the opposite.\n\n It's as simple as that.",
"Without a strong ego, you will keep quitting because you won't be convinced that you can do it.\n\n Without a strong ego, you're relegated to a secondary role in your own life."
]
